[
    {
        "title": "Database Schema Constructor",
        "date": "March 2024",
        "description": "Database Schema Constructor is a web application for visually creating and manipulating database schemas. It allows users to add tables, define attributes, and set constraints like NOT NULL, UNIQUE, PRIMARY KEY, and AUTO_INCREMENT. Features include SQL query generation and download, draggable tables for layout flexibility, and responsive design. Schemas can be persisted in local storage and cloud storage for future sessions.",
        "github": "https://github.com/ahmad-masud/Database-Schema-Constructor",
        "link": "https://dbsc.online/",
        "stacks": ["Javascript", "React", "Firebase", "Node.js", "jsPlumb"],
        "image": "dbsc.gif",
        "pinned": true
    },
    {
        "title": "Quant Market Predictor",
        "date": "February 2024",
        "description": "Quant Market Predictor is a Python-based tool designed to forecast future stock prices using historical market data from NASDAQ. Utilizing Linear Regression to make a Statistics Model, this project aims to provide users with insights into potential future market prices.",
        "github": "https://github.com/ahmad-masud/Quant-Market-Predictor?tab=readme-ov-file",
        "stacks": ["Python", "Pandas", "Numpy", "Matplotlib", "Scikit-learn"],
        "image": "qmp.gif",
        "pinned": true
    },
    {
        "title": "File Sorter",
        "date": "January 2024",
        "description": "The File Sorter Application is a Python-based tool designed to help organize files in a directory. It automatically sorts files into subdirectories based on chosen criteria: file size, file type, or date modified.",
        "github": "https://github.com/ahmad-masud/File-Sorter",
        "stacks": ["Python"],
        "image": "filesorter.gif",
        "pinned": false
    },
    {
        "title": "RateRover",
        "date": "June 2023",
        "description": "An application using React that leverages Java and JSX to facilitate currency conversion across different countries. This project allowed me to enhance my React proficiency and gain hands-on experience in making API calls with external websites and servers. Not only did this project provide me with an opportunity to improve my skills, but it also serves a practical purpose and can benefit a broad range of users.",
        "github": "https://github.com/ahmad-masud/RateRover",
        "link": "https://ahmadmasud.com/RateRover",
        "stacks": ["Javascript", "React", "JSX", "CSS"],
        "image": "raterover.gif",
        "pinned": false
    },
    {
        "title": "DrawAnt",
        "date": "April 2023",
        "description": "DrawAnt is a simple drawing program designed for ease of use and versatility. With DrawAnt, you can create beautiful drawings with a variety of tools such as pencils, brushes, shapes, and text. You can also adjust the size, color, and opacity of your tools to create the perfect design. DrawAnt has an intuitive user interface that allows for easy navigation and use of its features.",
        "github": "https://github.com/ahmad-masud/DrawAnt",
        "stacks": ["Java", "Swing", "Ant"],
        "image": "drawant.gif",
        "pinned": false
    },
    {
        "title": "Sorting Visualizer",
        "date": "December 2022",
        "description": "An application that implements java swing to draw out a visual of the process of loop sorting. There are interactive buttons to visualize different sorting algorithms and a slider to change the delay in between swaps. The height of each bar corresponds to its value and its x position corresponds to its index in the array.",
        "github": "https://github.com/ahmad-masud/Sorting-Visualizer",
        "stacks": ["Java", "Swing", "Maven"],
        "image": "sortingvisualizer.gif",
        "pinned": true
    }
  ]  